{
    "intents":[
{
    
    "tag":"greeting",
    "patterns":[
        "Hi, how are you?",
        "Hey",
        "Hey there",
        "Whatsup",
        "Hi ember",
        "Hello"
        ],
        "responses":[
            "Hey,there how may I help you",
            "Good Day, I am Ember, how can I help you",
            "Welcome to CarbonFit"
        ]
},
{
    "tag":"leaving",
    "patterns":[
        "Bye",
        "Quit",
        "See you",
        "Close chatbot"
        ],
        "responses":[
            "Bye Bye, hope to see you soon",
            "Byeee, Have a good day"
        ]
},
{
    "tag":"calculate",
    "patterns":[
        "How is carbon footprint calculated",
        "Calculate my footprint", 
        "How does carbon footprint affect me" 
    ],
    "responses":[
        "Your Carbon footprint will be calculated based on factors like transport preferences, electricity, food consumption, waste and public transport ie buses trains and flights. I can also tell you how these factors individually affect your total"
    ]
},
{
    "tag":"Gen-info",
    "patterns":[
        "What is Carbon Footprint",
        "What are green house gases",
        "Why is Co2 harmful",
        "How does carbon footprint affect the environment"
    ],
    "responses":[
        "Carbon Footprint is the amount of green house gases like CO2 and Methane that are being released into the environment. This is harmful because it results in global warming and degradation of the environment"
    ]
},
{
    "tag":"alternatives",
    "patterns":[
        "What can I do to reduce my footprint",
        "What can i do to reduce my print",
        "What are the alternatives",
        "How can i reduce my carbon footprint",
        "Show me the alternatives",
        "How do alternatives work",
        "What are the alternatives for reducing my Footprint"
    ],
    "responses":[
        "To reduce the carbon footprint you can first calculate your print using CarbonFit and then reduce your consumption in sectors which contribute to your print the most in the alternatives section"
    ] 
},
{
    "tag": "offsetting",
    "patterns":[
        "What is offsetting",
        "How does offsetting work",
        "What do you mean by carbon offsetting",
        "Offsetting",
        "How can i donate to offset my carbon footprint",
        "How can i offset my carbon footprint"
    ],
    "responses":[
        "A carbon offset is a reduction in emissions of carbon dioxide and other greenhouse gases made in order to compensate for emissions made elsewhere.You can donate to different projects in India to make a difference. More details can be found in the Offsetting section"
    ]
},
{
    "tag":"miscellaneous",
    "patterns":[],
    "responses":[
        "My bad, I dont know how to answer that",
        "Ahh so sorry, I don't know how to answer that"
    ]
}

]
}
